// Task6
// Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).
int n = 4;
Console.WriteLine("Число " + n + " четное?");
if (n % 2 == 0)
{
    Console.WriteLine("Да!");
}
else
{
Console.WriteLine("Нет!");
}
Console.WriteLine("=====================");
int n2 = -3;
Console.WriteLine("Число " + n2 + " четное?");
if (n2 % 2 == 0)
{
    Console.WriteLine("Да!");
}
else
{
Console.WriteLine("Нет!");
}
Console.WriteLine("=====================");
int n3 = 7;
Console.WriteLine("Число " + n3 + " четное?");
if (n3 % 2 == 0)
{
    Console.WriteLine("Да!");
}
else
{
Console.WriteLine("Нет!");
}
