// Task 8
// Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.
int N = 5;
Console.WriteLine("Ваше число = " + N + ", список четных чисел от 1 до " + N + ":");
for (int i = 1; i <= N; i++)
    if (i % 2 == 0)
        Console.Write(i + "  ");
Console.WriteLine("====================================================");

int N2 = 8;
Console.WriteLine("Ваше число = " + N2 + ", список четных чисел от 1 до " + N2 + ":");
for (int i = 1; i <= N2; i++)
    if (i % 2 == 0)
        Console.Write(i + "  ");